In [1]:
# datasets #
# ======== #
import pandas as pd
import numpy as np

from sklearn import datasets
titanic_path = "../datasets/titanic/train.csv"
bike_path = "../datasets/bike-sharing-demand/train.csv"
X_iris, y_iris = datasets.load_iris(return_X_y=True, as_frame=True)
df_iris = pd.concat([X_iris, y_iris], axis=1)
X_diab, y_diab = datasets.load_diabetes(return_X_y=True, as_frame=True)
df_diab = pd.concat([X_diab, y_diab], axis=1)

import warnings
warnings.filterwarnings('ignore')

# Pandas

## Series
- numpy ndarray를 기반으로 인덱싱 기능을 추가한 1차원 배열
- series의 연산은 index를 기준으로 이루어진다


### Series Operators
- size: 개수 반환
- shape: 튜플형태로 shape 반환
- unique(): 유일한 값만 ndarray로 반환
- count(): NaN을 제외한 개수를 반환
- mean(): NaN을 제외한 평균
    - mean()을 np array에다가 하면 값이 NaN이 나온다
    - series의 mean()은 NaN을 무시한다
- value_counts(): NaN을 제외하고 각 값들의 빈도를 반환

In [4]:
s1 = pd.Series(np.arange(5), np.arange(100, 105), dtype=np.int32)
s1

100    0
101    1
102    2
103    3
104    4
dtype: int32

In [5]:
print(s1.index)
print(s1.values)
print(s1[100], s1[104])

Int64Index([100, 101, 102, 103, 104], dtype='int64')
[0 1 2 3 4]
0 4

In [6]:
s2 = pd.Series([1, 1, 2, 1, 2, 2, 2, 1, 1, 3, 3, 4, 5, 6, 7, np.NaN])
s2

0     1.0
1     1.0
2     2.0
3     1.0
4     2.0
5     2.0
6     2.0
7     1.0
8     1.0
9     3.0
10    3.0
11    4.0
12    5.0
13    6.0
14    7.0
15    NaN
dtype: float64

In [7]:
print(s2.size)
print(s2.shape)
print(s2.unique())
print(s2.count())
print(s2.mean())
print("")
print(s2.value_counts())

16
(16,)
[ 1.  2.  3.  4.  5.  6.  7. nan]
15
2.7333333333333334

1.0    5
2.0    4
3.0    2
4.0    1
5.0    1
6.0    1
7.0    1
dtype: int64

### Series Slicing
- s.drop('k')를 하면 series의 'k' 인덱스 값을 제거한다.
    - s 자체에는 변화를 주지 않는 함수다.
    - drop의 parameter 중 inplace=True로 하면 원본에 변화를 준다.

## DataFrame

### DF 파악

- df.shape
- df.describe()
- df.info()
- df.index
    - df.index = np.arange(100,200)  => 이라고 하면 df의 인덱스를 100~199까지의 숫자로 바꾸는 것
- df.columns
- df.corr()   => 변수간 상관계수를 보여준다.
    - plt.matshow(df.corr())   => 상관계수를 visualize 해준다.

In [8]:
# columns, index, index.values
df = pd.read_csv(titanic_path)

print('columns:', df.columns)
print('index:', df.index)
print('index value:', df.index.values[0:10])

columns: Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
index: RangeIndex(start=0, stop=891, step=1)
index value: [0 1 2 3 4 5 6 7 8 9]

### DF 생성

In [9]:
# from dictionary
data = {'a' : [100, 200, 300], 'b': [1, 2, 3], 'c': [4, 5, 6]}
pd.DataFrame(data, index=[100, 200, 300])

       a  b  c
100  100  1  4
200  200  2  5
300  300  3  6

In [10]:
# from series
a = pd.Series([100, 200, 300], ['a', 'b', 'c'])
b = pd.Series([101, 202, 303], ['a', 'b', 'c'])
c = pd.Series([110, 220, 330], ['a', 'b', 'c'])

pd.DataFrame([a, b, c])

     a    b    c
0  100  200  300
1  101  202  303
2  110  220  330

In [11]:
# from path
train_data = pd.read_csv(titanic_path)

#### 상호변환 : df - ndarray - list - dict

In [12]:
import numpy as np

col_name1=['col1']
list1 = [1, 2, 3]
array1 = np.array(list1)

print('array1 shape:', array1.shape )
df_list1 = pd.DataFrame(list1, columns=col_name1)
print('1차원 리스트로 만든 DataFrame:\n', df_list1)
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 ndarray로 만든 DataFrame:\n', df_array1)

array1 shape: (3,)
1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3
1차원 ndarray로 만든 DataFrame:
    col1
0     1
1     2
2     3

In [13]:
# 3개의 컬럼명이 필요함.
col_name2=['col1', 'col2', 'col3']

# 2행x3열 형태의 리스트와 ndarray 생성 한 뒤 이를 DataFrame으로 변환.
list2 = [[1, 2, 3],
         [11, 12, 13]]
array2 = np.array(list2)
print('array2 shape:', array2.shape )
df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2차원 리스트로 만든 DataFrame:\n', df_list2)
df_array1 = pd.DataFrame(array2, columns=col_name2)
print('2차원 ndarray로 만든 DataFrame:\n', df_array1)

array2 shape: (2, 3)
2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [14]:
# 딕셔너리(dict)에서 DataFrame변환
# Key는 컬럼명으로 매핑, Value는 리스트 형(또는 ndarray)
dict = {'col1':[1, 11], 'col2':[2, 22], 'col3':[3, 33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n', df_dict)

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

In [15]:
# DataFrame을 ndarray로 변환
array3 = df_dict.values
print('df_dict.values 타입:', type(array3), 'df_dict.values shape:', array3.shape)
print(array3)

df_dict.values 타입: <class 'numpy.ndarray'> df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 22 33]]

In [16]:
# DataFrame을 리스트로 변환
list3 = df_dict.values.tolist()
print('df_dict.values.tolist() 타입:', type(list3))
print(list3)

# DataFrame을 딕셔너리로 변환
dict3 = df_dict.to_dict('list')
print('\n df_dict.to_dict() 타입:', type(dict3))
print(dict3)

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 22, 33]]

 df_dict.to_dict() 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

### DF Slicing

In [17]:
train_data = pd.read_csv(titanic_path)

In [18]:
# select columns
train_data['Survived']
train_data[['Survived', 'Age', 'Name']]

     Survived   Age                                               Name
0           0  22.0                            Braund, Mr. Owen Harris
1           1  38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1  26.0                             Heikkinen, Miss. Laina
3           1  35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0  35.0                           Allen, Mr. William Henry
..        ...   ...                                                ...
886         0  27.0                              Montvila, Rev. Juozas
887         1  19.0                       Graham, Miss. Margaret Edith
888         0   NaN           Johnston, Miss. Catherine Helen "Carrie"
889         1  26.0                              Behr, Mr. Karl Howell
890         0  32.0                                Dooley, Mr. Patrick

[891 rows x 3 columns]

In [19]:
# row slicing
train_data[:10]   # DataFrame에서 대괄호는 칼럼이 기본이나,
                  # slicing은 row-level임.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [20]:
# df에서 series 혹은 df 필터링 추출
print(df['Age'][0:5])   # series

df[['Age']].head()  # df
df[['Age', 'Sex']].head() # df

# 즉 df[] 안에 list를 넣으면 df가 추출된다.

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

#### df.query

In [21]:
# 아래 셋 다 같다
df.query('Survived == 0')
df[df['Survived'] == 0]
df[df.Survived == 0]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
# 아래 둘도 같다
df[df.Pclass > df.SibSp]
df.query('Pclass > SibSp')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [23]:
# 이런 것도 가능하다
df.query('Pclass == 2 & Survived == 0')
df.query('Pclass > 2 | Survived == 1')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

#### df.iloc / df.loc
- row는 slicing보다 loc과 iloc으로 선택한다
- loc - 인덱스 자체를 사용
- iloc - 0 based index를 사용
- loc & iloc은 ,를 사용하여 column도 선택 가능

In [24]:
df.iloc[0:4, 0:1]

## iloc을 사용하면 '숫자 슬라이스'하듯이 0:4 했을 때 0~3까지만 된다

   PassengerId
0            1
1            2
2            3
3            4

In [25]:
df.loc[0:4, 'Survived':'Pclass']

# loc은 '문자 슬라이스' => 슬라이스의 앞뒤를 포함해서 모두 가져온다

   Survived  Pclass
0         0       3
1         1       1
2         1       3
3         1       1
4         0       3

In [26]:
train_data.index = np.arange(100, 991)

train_data.loc[986]  #'986' index의 row를 series로 가져온다.
train_data.iloc[0:3]  #0-based index를 사용해서 row-slicing한 꼴.
train_data.loc[[986, 100, 110, 990], ['Name', 'Survived', 'Sex', 'Age']]   #row와 column을 모두 선택할 수도 있다.

                                Name  Survived     Sex   Age
986            Montvila, Rev. Juozas         0    male  27.0
100          Braund, Mr. Owen Harris         0    male  22.0
110  Sandstrom, Miss. Marguerite Rut         1  female   4.0
990              Dooley, Mr. Patrick         0    male  32.0

#### Boolean

In [27]:
# boolean indexing으로도 selection을 많이 한다.
df[df['Age'] > 60][['Name', 'Age']].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [28]:
df[['Name','Age']][df['Age'] > 60].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [29]:
df[(df['Age'] > 60) & (df['Pclass']==1) & (df['Sex']=='female')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

#### Filter

In [42]:
df.filter(like='P').head(3)

   PassengerId  Pclass  Parch
0            1       3      0
1            2       1      0
2            3       3      0

#### Dtype

In [43]:
df.select_dtypes(include=['float']).head(3)

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250

### Reindexing

In [36]:
# reindex는 copy를 생성하기 때문에 원본에 영향 없음
df.reindex([0,63,691,3056])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
63,64.0,0.0,3.0,"Skoog, Master. Harald",male,4.0,3.0,2.0,347088,27.9000,NaN,S
691,692.0,1.0,3.0,"Karun, Miss. Manca",female,4.0,0.0,1.0,349256,13.4167,NaN,C
3056,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [37]:
# fill_value method
df.reindex([0,63,691,3056], fill_value=0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
63,64,0,3,"Skoog, Master. Harald",male,4.0,3,2,347088,27.9000,NaN,S
691,692,1,3,"Karun, Miss. Manca",female,4.0,0,1,349256,13.4167,NaN,C
3056,0,0,0,0,0,0.0,0,0,0,0.0000,0,0

### Sorting

#### Top N

In [38]:
df.nsmallest(5, 'Age')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S

In [39]:
# Age가 가장 낮은 100명 중 Fare가 가장 큰 5개
df.nsmallest(100, "Age").nlargest(5, "Fare")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
689,690,1,1,"Madill, Miss. Georgette Alexandra",female,15.00,0,1,24160,211.3375,B5,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
802,803,1,1,"Carter, Master. William Thornton II",male,11.00,1,2,113760,120.0000,B96 B98,S
435,436,1,1,"Carter, Miss. Lucile Polk",female,14.00,1,2,113760,120.0000,B96 B98,S

#### Sort_values

In [40]:
df.sort_values('Age').head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C

In [41]:
df.sort_values(
    ['Age', 'Fare'],
    ascending=[True, False]
).head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C

## Arithmetic

### (참고) 연산 기준
- DataFrame은 Column 기준
- Series는 index 기준
- 따로 명시가 없다면 Series의 index가 DataFrame의 columns에 맞춰짐

In [47]:
import FinanceDataReader as fdr
price_df = fdr.DataReader('005930','2009-09-16','2018-03-21')
price_df.head(3)

             Open   High    Low  Close  Volume    Change
Date
2009-09-16  15400  16000  15320  15900  711387  0.033810
2009-09-17  16120  16200  15920  16200  494941  0.018868
2009-09-18  16200  16400  16080  16120  896503 -0.004938

### Series & DataFrame

In [48]:
price_df.iloc[0]

Open       15400.00000
High       16000.00000
Low        15320.00000
Close      15900.00000
Volume    711387.00000
Change         0.03381
Name: 2009-09-16 00:00:00, dtype: float64

In [49]:
# subtract row Series
# DataFrame의 기준인 columns와 Series의 기준인 index가 서로 일치함.
## → 의도한대로 계산됨!
(price_df - price_df.iloc[0]).head(3)

             Open   High    Low  Close    Volume    Change
Date
2009-09-16    0.0    0.0    0.0    0.0       0.0  0.000000
2009-09-17  720.0  200.0  600.0  300.0 -216446.0 -0.014942
2009-09-18  800.0  400.0  760.0  220.0  185116.0 -0.038748

In [51]:
# subtract column Series
price_df['Open'].head(3)

Date
2009-09-16    15400
2009-09-17    16120
2009-09-18    16200
Name: Open, dtype: int64

In [52]:
(price_df - price_df['Open']).head(3)

,2009-09-16 00:00:00,2009-09-17 00:00:00,2009-09-18 00:00:00,2009-09-21 00:00:00,2009-09-22 00:00:00,2009-09-23 00:00:00,2009-09-24 00:00:00,2009-09-25 00:00:00,2009-09-28 00:00:00,2009-09-29 00:00:00,...,2018-03-16 00:00:00,2018-03-19 00:00:00,2018-03-20 00:00:00,2018-03-21 00:00:00,Change,Close,High,Low,Open,Volume
Date,,,,,,,,,,,,,,,,,,,,,
2009-09-16,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-09-17,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-09-18,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### DataFrame & DataFrame
- index, column이 일치하는 것들 끼리만 element-wise 연산이 이루어지고 나머지는 nan 처리

In [54]:
price_df[['Open','Low']].iloc[2]

Open    16200
Low     16080
Name: 2009-09-18 00:00:00, dtype: int64

In [55]:
(price_df - price_df[['Open', 'Low']].iloc[2]).head()

            Change  Close  High    Low   Open  Volume
Date
2009-09-16     NaN    NaN   NaN -760.0 -800.0     NaN
2009-09-17     NaN    NaN   NaN -160.0  -80.0     NaN
2009-09-18     NaN    NaN   NaN    0.0    0.0     NaN
2009-09-21     NaN    NaN   NaN -200.0 -160.0     NaN
2009-09-22     NaN    NaN   NaN -121.0 -200.0     NaN

### sub()

In [57]:
# 아래 연산은 불가했음
close_series = price_df['Close']
(price_df - close_series).head(3)

,2009-09-16 00:00:00,2009-09-17 00:00:00,2009-09-18 00:00:00,2009-09-21 00:00:00,2009-09-22 00:00:00,2009-09-23 00:00:00,2009-09-24 00:00:00,2009-09-25 00:00:00,2009-09-28 00:00:00,2009-09-29 00:00:00,...,2018-03-16 00:00:00,2018-03-19 00:00:00,2018-03-20 00:00:00,2018-03-21 00:00:00,Change,Close,High,Low,Open,Volume
Date,,,,,,,,,,,,,,,,,,,,,
2009-09-16,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-09-17,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-09-18,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [59]:
close_series.head(3)

Date
2009-09-16    15900
2009-09-17    16200
2009-09-18    16120
Name: Close, dtype: int64

In [60]:
# .sub()을 이용하면 가능!
price_df.sub(close_series, axis=0).head(3)

            Open  High  Low  Close  Volume        Change
Date
2009-09-16  -500   100 -580      0  695487 -15899.966190
2009-09-17   -80     0 -280      0  478741 -16199.981132
2009-09-18    80   280  -40      0  880383 -16120.004938